Frameworks-Etc/spring.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-12-13 周四 01:33 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Spring Framework</title>
<meta name="generator" content="Org mode">
<meta name="author" content="孙悟空">
<link rel='stylesheet' href='/asset/common.css' />
</head>
<body>
<div id="content">
<header>
<h1 class="title">Spring Framework</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org647e25c">1. vs. 工厂模式</a></li>
</ul>
</div>
</nav>


<section id="outline-container-org647e25c" class="outline-2">
<h2 id="org647e25c"><span class="section-number-2">1</span> vs. 工厂模式</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">ServiceFactory</span> {
    <span class="org-keyword">public</span> <span class="org-type">Object</span> <span class="org-function-name">getServiceObject</span> (<span class="org-type">String</span> <span class="org-variable-name">name</span>) {
        <span class="org-keyword">if</span> (name.equals(<span class="org-string">"bs"</span>)) {
            <span class="org-type">A</span> <span class="org-variable-name">a</span> = <span class="org-keyword">new</span> <span class="org-type">A</span>();
            <span class="org-type">B</span> <span class="org-variable-name">b</span> = <span class="org-keyword">new</span> <span class="org-type">B</span>(a); <span class="org-comment-delimiter">// </span><span class="org-comment">&#26500;&#36896;&#22120;</span>
            <span class="org-type">MyBatiscConnection</span> <span class="org-variable-name">conn</span> = <span class="org-keyword">new</span> <span class="org-type">MyBatiscConnection</span>();
            <span class="org-type">LogUtil</span> <span class="org-variable-name">log</span> = <span class="org-keyword">new</span> <span class="org-type">LogUtil</span>();
            <span class="org-type">BookService</span> <span class="org-variable-name">bookservice</span> = <span class="org-keyword">new</span> <span class="org-type">BookService</span>();

            b.setA(a); <span class="org-comment-delimiter">// </span><span class="org-comment">setter</span>
            conn.setB(b);
            bookservice.setConn(conn);
            LogUtil.setConn(conn);
            bookservice.setLogger(log);

            <span class="org-keyword">return</span> bookservice;
        }
    }
}

<span class="org-function-name">main</span> () {
    <span class="org-type">ServiceFactory</span> <span class="org-variable-name">sf</span> = <span class="org-keyword">new</span> <span class="org-type">ServiceFactory</span>();

    <span class="org-type">BookService</span> <span class="org-variable-name">bookservice</span> = sf.getServiceObject(<span class="org-string">"bs"</span>);
    bookservice.sellBook();
}
</pre>
</div>

<p>
将工厂模式切割，分为解析程序和 xml 文件。
</p>

<p>
xml 暴露出来，用来<b>描述</b>工厂需要实例化的类以及他们之间的关系。
</p>

<div class="org-src-container">
<pre class="src src-sgml">&lt;<span class="org-function-name">xml</span>&gt;
  <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">&#20043;&#21069;&#21629;&#20196;&#65307;&#25551;&#36848; </span><span class="org-comment-delimiter">--&gt;</span>
  &lt;<span class="org-function-name">bean</span> <span class="org-variable-name">id</span>=<span class="org-string">"a"</span> <span class="org-variable-name">class</span>=<span class="org-string">"xxx.yyy.A"</span> /&gt;
  &lt;<span class="org-function-name">bean</span> <span class="org-variable-name">id</span>=<span class="org-string">"b"</span> <span class="org-variable-name">class</span>=<span class="org-string">"xxx.yyy.B"</span>&gt;
    &lt;<span class="org-function-name">property</span> <span class="org-variable-name">name</span>=<span class="org-string">"a"</span> <span class="org-variable-name">bean</span>=<span class="org-string">"a"</span> /&gt;
  &lt;/<span class="org-function-name">bean</span>&gt;
  &lt;<span class="org-function-name">bean</span> <span class="org-variable-name">id</span>=<span class="org-string">"conn"</span> <span class="org-variable-name">class</span>=<span class="org-string">"xxx.yyy.MyBConn"</span>&gt;
    &lt;<span class="org-function-name">property</span> <span class="org-variable-name">name</span>=<span class="org-string">"b"</span> <span class="org-variable-name">bean</span>=<span class="org-string">"b"</span> /&gt;
  &lt;/<span class="org-function-name">bean</span>&gt;
  &lt;<span class="org-function-name">bean</span> <span class="org-variable-name">id</span>=<span class="org-string">"log"</span> <span class="org-variable-name">class</span>=<span class="org-string">"xxx.yyy.LogUtil"</span>&gt;
    &lt;<span class="org-function-name">property</span> <span class="org-variable-name">name</span>=<span class="org-string">"conn"</span> <span class="org-variable-name">bean</span>=<span class="org-string">"conn"</span> /&gt;
  &lt;/<span class="org-function-name">bean</span>&gt;
  &lt;<span class="org-function-name">bean</span> <span class="org-variable-name">id</span>=<span class="org-string">"bookservice"</span> <span class="org-variable-name">class</span>=<span class="org-string">"xxx.BookService"</span>&gt;
    &lt;<span class="org-function-name">property</span> <span class="org-variable-name">name</span>=<span class="org-string">"conn"</span> <span class="org-variable-name">bean</span>=<span class="org-string">"conn"</span> /&gt;
    &lt;<span class="org-function-name">property</span> <span class="org-variable-name">name</span>=<span class="org-string">"log"</span> <span class="org-variable-name">bean</span>=<span class="org-string">"log"</span> /&gt;
  &lt;/<span class="org-function-name">bean</span>&gt;
&lt;/<span class="org-function-name">xml</span>&gt;
</pre>
</div>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: 孙悟空</p>
<p class="date">Created: 2018-12-13 周四 01:33</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
